import React from "react";
import styles from "./portfolio.module.css";
import ContactBtn from "@/components/contactUsBtn/ContactBtn";
import PortfolioCard from "@/components/PortfolioCard/PortfolioCard";
function PortfolioPage() {
    return (
        <div className={styles.portfolioPage}>
            <section className={styles.portfolioBanner}>
                <div className={styles.imgPart}>
                    <img src="/building/building2.png" alt="تصویری از یک ساختمان" className={styles.banner} />
                </div>
                <div className={styles.textPart}>
                    <h1>
                        هر پروژه، یک بنای ماندگار <b>.</b>
                    </h1>
                    <p>
                        در آجر چین باور داریم که هر پروژه فراتر از یک کار اجرایی ساده است؛ هر سازه، داستانی تازه و اثری
                        ماندگار است. ما تنها دیوارها و سقف‌ها را کنار هم نمی‌چینیم، بلکه با دقت در طراحی، کیفیت در اجرا
                        و پایبندی به جزئیات، تجربه‌ای متفاوت می‌سازیم که سال‌ها پابرجا می‌ماند. از اولین جرقه‌ی یک ایده
                        تا لحظه‌ای که بنا به واقعیت بدل می‌شود، تیم ما همراه و همدل با شماست. نتیجه‌ی این همراهی،
                        سازه‌هایی است که نه تنها نیاز امروز را برآورده می‌کنند، بلکه به میراث فردا نیز بدل خواهند شد.
                    </p>
                    <section className={styles.btnSection}>
                        <ContactBtn />
                    </section>
                </div>
                <div className={styles.customShapeDividerBottom}>
                    <svg
                        data-name="Layer 1"
                        xmlns="http://www.w3.org/2000/svg"
                        viewBox="0 0 1200 120"
                        preserveAspectRatio="none"
                    >
                        <path
                            d="M0,0V46.29c47.79,22.2,103.59,32.17,158,28,70.36-5.37,136.33-33.31,206.8-37.5C438.64,32.43,512.34,53.67,583,72.05c69.27,18,138.3,24.88,209.4,13.08,36.15-6,69.85-17.84,104.45-29.34C989.49,25,1113-14.29,1200,52.47V0Z"
                            opacity=".25"
                            className="shape-fill"
                        ></path>
                        <path
                            d="M0,0V15.81C13,36.92,27.64,56.86,47.69,72.05,99.41,111.27,165,111,224.58,91.58c31.15-10.15,60.09-26.07,89.67-39.8,40.92-19,84.73-46,130.83-49.67,36.26-2.85,70.9,9.42,98.6,31.56,31.77,25.39,62.32,62,103.63,73,40.44,10.79,81.35-6.69,119.13-24.28s75.16-39,116.92-43.05c59.73-5.85,113.28,22.88,168.9,38.84,30.2,8.66,59,6.17,87.09-7.5,22.43-10.89,48-26.93,60.65-49.24V0Z"
                            opacity=".5"
                            className="shape-fill"
                        ></path>
                        <path
                            d="M0,0V5.63C149.93,59,314.09,71.32,475.83,42.57c43-7.64,84.23-20.12,127.61-26.46,59-8.63,112.48,12.24,165.56,35.4C827.93,77.22,886,95.24,951.2,90c86.53-7,172.46-45.71,248.8-84.81V0Z"
                            className="shape-fill"
                        ></path>
                    </svg>
                </div>
            </section>
            <section className={styles.portfolioProjectTitel}>
                <h2>نمونه کارهای گروه ساختمان‌سازی آجرچین</h2>
                <p>
                    گروه آجرچین با تجربه‌ای حرفه‌ای در ساخت و ساز، پروژه‌هایی ایمن، باکیفیت و زیبا خلق می‌کند. از
                    خانه‌های مسکونی تا مجتمع‌های تجاری، هر پروژه ما نمایانگر دقت، نوآوری و تعهد ما به کیفیت است. با دیدن
                    نمونه کارهای ما، با سبک حرفه‌ای و استانداردهای بالای آجرچین آشنا شوید.
                </p>
            </section>
            <section className={styles.portfolioProject}>
                <PortfolioCard
                    title="ساختمان میلاد"
                    text="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                    image="/building/building2.jpg"
                    link="#"
                />
                <PortfolioCard
                    title="ساختمان میلاد"
                    text="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                    image="/building/building2.jpg"
                    link="#"
                />
                <PortfolioCard
                    title="ساختمان میلاد"
                    text="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                    image="/building/building2.jpg"
                    link="#"
                />
                <PortfolioCard
                    title="ساختمان میلاد"
                    text="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                    image="/building/building2.jpg"
                    link="#"
                />
                <PortfolioCard
                    title="ساختمان میلاد"
                    text="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                    image="/building/building2.jpg"
                    link="#"
                />
                <PortfolioCard
                    title="ساختمان میلاد"
                    text="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
                    image="/building/building2.jpg"
                    link="#"
                />
            </section>
            <section className={styles.portfolioContactus}>
                <h2>با هم رویای شما را می‌سازیم</h2>
                <p>آیا آماده‌اید تا رویای خود را به واقعیت تبدیل کنید؟</p>
                <p>
                    با هم می‌توانیم ایده های شما را طراحی و آن را به ساختمانی زیبا، ایمن و پایدار تبدیل کنیم. همین حالا
                    با ما تماس بگیرید و اجازه دهید شروع یک تجربه متفاوت و حرفه‌ای را با هم رقم بزنیم!
                </p>
                <section className={styles.btnSection}>
                    <ContactBtn />
                </section>
            </section>
        </div>
    );
}

export default PortfolioPage;
